Revit 2017 API
IndependentTag.GetTaggedLocalElement Method
 Get the tagged local element if any.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public Element GetTaggedLocalElement()
Visual Basic
Public Function GetTaggedLocalElement As Element
Visual C++
public:
Element^ GetTaggedLocalElement()
Return Value
 The tagged local element, or null for orphan tags and tagged elements in links.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace